Revit 2027 API
UIDocument.CanPlaceElementType Method
 Verifies that the user can be prompted to place the input element type interactively.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanPlaceElementType(
	ElementType elementType
)
Public Function CanPlaceElementType (
	elementType As ElementType
) As Boolean
public:
bool CanPlaceElementType(
	ElementType^ elementType
)
member CanPlaceElementType :
        elementType : ElementType -> bool
Parameters
elementType ElementType
 The ElementType.
Return Value
Boolean
 True if the user can be prompted to place the input element type interactively, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If an element type can be placed interactively, it may be used as input to PostRequestForElementTypePlacement(ElementType) to have the user place an instance of the element. However, this function does not evaluate whether that element instance may actually be placed in the current active view.
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace